opencell-tests/bdd/src/test/resources/com/opencell/test/feature/scenarios/full/00003-sub-creation-service-activation-charging-invoicing/12-charge-and-rate-triggered-EDR/find-wallet-operations--create-wallet-operation--expected.json

{
    "code": "RS_BASE_USAGE1",
    "description": "RS_BASE-Forfait Test",
    "userAccount": "RS_BASE_UA",
    "walletTemplate": "PRINCIPAL",
    "seller": "SELLER_FR",
    "chargeInstance": "RS_BASE_USAGE1",
    "currency": "EUR",
    "status": "OPEN",
    "ratingUnitDescription": "Unit",
    "taxCode": "TAX_05",
    "taxPercent": 5.000000000000,
    "unitAmountWithoutTax": 9.000000000000,
    "unitAmountWithTax": 9.450000000000,
    "unitAmountTax": 0.450000000000,
    "quantity": 100.000000000000,
    "amountWithoutTax": 900.000000000000,
    "amountWithTax": 945.000000000000,
    "amountTax": 45.000000000000,
    "parameter1": "USAGE",
    "parameter2": "25000",
    "offerCode": "RS_BASE_OFFER1"
}
